["{\"setup\": \"A young woman is speeding down a country road going 90MPH and she gets pulled over by a police officer.\", \"punchline\": \"\\\"Young lady, I've been waiting for you all day\\\" he says.She replies, \\\"I know I came as fast as I could officer! \\\"\"}", "{\"setup\": \"A reporter is interviewing a wealthy investor and asks what the secrets were to his success. \\u201cWell, I\\u2019ll tell you one of the best financial decisions I made was based on stock advice I got from a shoe shiner\\u201d\", \"punchline\": \"\\u201cI figured if my shoe shiner is giving out stock tips, it\\u2019s probably right to get out of the market\\u201d\"}", "{\"setup\": \"TIL there are over 20,000 battered women in the U.S. everyday...\", \"punchline\": \"I don't know if I can ever go back to eating them plain...\"}", "{\"setup\": \"Did you hear about the mushroom who parked illegally?\", \"punchline\": \"He was Toad.\"}", "{\"setup\": \"What's brown and smells like bacon?\", \"punchline\": \"Kermits finger\"}", "{\"setup\": \"I really bonded with the guy at the glue factory.\", \"punchline\": \"We have been inseparable ever since we met.\"}", "{\"setup\": \"If you think Lab Grown Meat sounds bad, ...\", \"punchline\": \"You should try Pit-bull Grown Meat.  (Mine had sticks and cat-litter in it.)\"}", "{\"setup\": \"Why are dragons so good at rapping?\", \"punchline\": \"Because they're always spitting fire.\"}", "{\"setup\": \"I was reading a great book about an immortal dog the other day\", \"punchline\": \"It was impossible to put down\"}", "{\"setup\": \"In an ambulance\", \"punchline\": \"\\\"can you describe the snake that bit you?\\\"Me: \\\"yes,  it was like an angry rope\\\"\"}", "{\"setup\": \"It's crazy. One minute you're getting drunk as a skunk, then next thing you know, you're in the back of an ambulance.\", \"punchline\": \"I really shouldn't be a paramedic.\"}", "{\"setup\": \"Fred: he was dressing up as a ghost and scaring people away from the old fun park\", \"punchline\": \"**cop:** that's actually not illegal but tell me about the talking dog\"}", "{\"setup\": \"What does me and NASA have in common\", \"punchline\": \"We both want to colonize Uranus.\"}", "{\"setup\": \"Where is the safest place to be on a capsizing ship? (Worst joke ever)\", \"punchline\": \"The Galley!Everything but the kitchen sinks.^(I warned you)\"}", "{\"setup\": \"Saw a homeless man eating grass in the park\", \"punchline\": \"I asked him \\\"Why are you eating grass?\\\"He said \\\"I am very hungry\\\"I replied \\\"Oh, okay then. Come with me.\\\"You should've seen his face when I showed him my backyard.\"}", "{\"setup\": \"Women are the foundation of our society\", \"punchline\": \"But men are the ones who laid the foundation\"}", "{\"setup\": \"How was the snow globe feeling after the storm?\", \"punchline\": \"A little shaken.\"}", "{\"setup\": \"How can you tell if a hamburger was grilled in space?\", \"punchline\": \"It's a little meteor.\"}", "{\"setup\": \"The man who invented the television remote control passed away today\", \"punchline\": \"They found him at home between the couch cushions.\"}", "{\"setup\": \"What kind of tattoo does a Postal Service worker get?\", \"punchline\": \"A tramp stamp, and it says, \\\"No postage necessary if nailed in the US.\\\"\"}", "{\"setup\": \"Why is it difficult for orphans to play baseball?\", \"punchline\": \"Because it's hard to find home\"}", "{\"setup\": \"Although its great for getting out of trouble with bounty hunters\", \"punchline\": \"Han's tendency to shoot first did not make Leia very happy.\"}", "{\"setup\": \"There's an upcoming show featuring the woman from Tiger King and Batman's sidekick, going around and reviewing ice cream parlors\", \"punchline\": \"Carole Baskin And Robin's\"}", "{\"setup\": \"You may only get this joke if you live in the UK, so apologies...\", \"punchline\": \"Two packets of Crisps leave the cinema, a car pulls up alongside them and the driver offers them a lift, they reply, \\u2018No thanks, we\\u2019re Walkers\\u2019.\"}", "{\"setup\": \"Why do jedi always burn their pancakes?\", \"punchline\": \"Because they wont turn over to the dark side.\"}", "{\"setup\": \"The Mandalorian fell on hard times and had to take a job in a body building and health food shop. Turns out he was unexpectedly great at it and smashed the commission targets. He'd just direct people to the protein powder section, and say...\", \"punchline\": \"...\\\"This is the whey\\\"(Sorry)\"}", "{\"setup\": \"Why do girls always have the last word in an argument\", \"punchline\": \"Cause their the ones with a period\"}", "{\"setup\": \"The owl asked the most introspect question ever.\", \"punchline\": \"Who are you???\"}", "{\"setup\": \"My son came out of the closet today\", \"punchline\": \"I swear his body keeps falling out I knew I should have brought a better lock\"}", "{\"setup\": \"I have a great safety tip for Halloween this year\", \"punchline\": \"Wear a mask!!!\"}", "{\"setup\": \"How did the paramedics know Paul Walker had clean hair?\", \"punchline\": \"They found his head and shoulders in the glove box\"}", "{\"setup\": \"What do you call a pig with three eyes?\", \"punchline\": \"Piiig\"}", "{\"setup\": \"My daughter informed me that the earth is tilted at a 23.5 degree angle\", \"punchline\": \"I responded, \\u201cThat\\u2019s not right.\\u201dWith a scowl, she pulled up google and proved to me that the earth is, in fact, tilted at a 23.5 degree angle.\\u201cPrecisely,\\u201d I agreed. \\u201cIf the angle were right it would be 90\\u00b0.\\u201d\"}", "{\"setup\": \"I bet Santa spends a lot of time at strip clubs\", \"punchline\": \"He loves them ho ho ho\\u2019s\"}", "{\"setup\": \"What do you call an onion that likes to rhyme?\", \"punchline\": \"A Rapscallion!\"}", "{\"setup\": \"What did Barack Obama write inside his Valentines card?\", \"punchline\": \"\\\"I'm glad I've got you Michelle; I didn't want to be Obamaself\\\"\"}", "{\"setup\": \"I call my wife Bambi, she thinks it's because she is cute with big brown eyes.\", \"punchline\": \"But in reality I just hope someone shoots her mother with a hunting rifle.\"}", "{\"setup\": \"I like updoots, I like silver\", \"punchline\": \"Cake day cake day please deliver\"}", "{\"setup\": \"What do u call a knight who\\u2019s really sketchy?\", \"punchline\": \"Sir Spishus\"}", "{\"setup\": \"New Zelda game, starring just the princess, that ties all the story lines together...\", \"punchline\": \"\\\"The Missing Link\\\"\"}", "{\"setup\": \"What's the difference between a blonde and a washer?\", \"punchline\": \"When you dump your load in a washer, it doesn't follow you around for a week.\"}", "{\"setup\": \"My dad always turns his head slightly away from the printer when he's using it\", \"punchline\": \"Apparently he can only see it in his peripheral vision.\"}", "{\"setup\": \"Two dogs are sitting in a bar. The first says, \\\"wanna hear a joke?\\\" The second dog says \\\"sure!\\\" The first dog says \\\"knock knock.\\\" The second says...\", \"punchline\": \"WOOF WOOF WOOF! WOOF WOOF WOOF WOOF WOOF!!\"}", "{\"setup\": \"You know the clothing company Puma? They make Puma shirts, Puma socks...\", \"punchline\": \"I wonder why they don't make pants\"}", "{\"setup\": \"Why did the horny fish join the Peace Corps?\", \"punchline\": \"He wanted to build some schools.\"}", "{\"setup\": \"What do you call a cute bull fighter?\", \"punchline\": \"Matadorable\"}", "{\"setup\": \"LPT for stretching your food budget\", \"punchline\": \"Cut a minute steak into 60 pieces.  Then everyone can have seconds.\"}", "{\"setup\": \"My girlfriend and I are huge movie quoters. When we give each other presents, we say, \\\"WHAT'S IN THE BOX?! WHAT'S IN THE BOX?!?!?!?!\\\"\", \"punchline\": \"Apparently when she asks, \\\"How do I look?\\\" \\\"That'll do, Pig. That'll do,\\\" isn't the right movie quote...\"}", "{\"setup\": \"A man had the most dangerous spider in the world, a Brown Recluse, stuck in his keyboard.\", \"punchline\": \"He called his wife about it.\\\"Hey honey, I have a venomous spider in my house!\\\" He said.\\\"Oh my God, are you okay?\\\" His wife asked.\\\"Yes, I have it under CTRL.\\\"\"}", "{\"setup\": \"There is a coin shortage in America\", \"punchline\": \"They are officially out of Common Cents\"}", "{\"setup\": \"Mario goes to court\", \"punchline\": \"The judge says: \\u201cyou must pay the court $12,000.\\u201dMario, surprised, asks: \\u201cWhy?\\u201dThe judge replies: \\u201cIt\\u2019s a fine.\\u201dMario, heartbroken, sadly says: \\u201cNo itsa not.\\u201d\"}", "{\"setup\": \"Why was the overweight kid proud of his family's criminal history?\", \"punchline\": \"He kept being told stories of how his grandfather and father were both big men and everyone knew they were well hung.\"}", "{\"setup\": \"My internet connection and my diet are missing one thing in common...\", \"punchline\": \"Fiber\"}", "{\"setup\": \"Today I learned, when someone says ' take my breath away ' they...\", \"punchline\": \"don't mean their asthma pump.\"}", "{\"setup\": \"Stupid people are like Slinkies.\", \"punchline\": \"They don't have much purpose, but it's fun to push them down the stairs.\"}", "{\"setup\": \"Give a man a plane ticket and he'll fly for a day.\", \"punchline\": \"Push a man out of a plane, and he'll fly for the rest of his life.\"}", "{\"setup\": \"The cross-eyed judge looked at the 3 defendants\", \"punchline\": \"How do you plead? he asked the first man. Not guilty, said the second. I wasn\\u2019t talking to you, said the judge.  I didn\\u2019t say a word, said the third.\"}", "{\"setup\": \"I asked my teenage niece to go get me a newspaper, she laughed at me and said \\\"oh uncle , you're so old. Just use my phone\\\"\", \"punchline\": \"So I slammed her phone against the wall to kill the fly.\"}", "{\"setup\": \"What do you call a chav in a box?\", \"punchline\": \"Innit.What do you call a chav in a locked box?Safe.\"}", "{\"setup\": \"Your mum is so slow\", \"punchline\": \"It took her 9 months to come up with a good joke\"}", "{\"setup\": \"(NSFW) Did you hear about the baby in Iraq who was born with 3 penises?\", \"punchline\": \"I bet his pants fit like a glove..-Credit to u/no_hidden_talent who made the joke in the comment section of a news article.\"}", "{\"setup\": \"I put scaffolding on my Hi-fi and steel girders on my digital radio.\", \"punchline\": \"Then my mom told me to stop reinforcing stereo types.\"}", "{\"setup\": \"I'm gonna lose my mind if someone says they cant breathe or talk wearing a face mask\", \"punchline\": \"I had a girl in my basement for seven months wearing a ball gag and she's fine\"}", "{\"setup\": \"So a couple of farmers are standing around talking. One goes you know, \\\"I had a bull who just wouldn't breed anything, so I took him to the vet and she gave me some pills to give to him. Well he bred all of my cows and jumped the fence and bred all of the neighbors cows!\\\"\", \"punchline\": \"The other farmer looked at him and asked what kind of pills they were and the first one responds, \\\"I don't know, but they kinda taste like mint.\\\"\"}", "{\"setup\": \"My dad said he'd delete my computer games if I didn't finish mowing the lawn. I did the first half pretty quickly...\", \"punchline\": \"but now I'm losing Steam.\"}", "{\"setup\": \"My homeboy got rear-ended on a motorcycle wearing a bright green shirt, with shiny red hair: It kind of makes sense....\", \"punchline\": \"It was hard to miss him\"}", "{\"setup\": \"What do you call it when a bunch of anti-maskers are kicked out of a store?\", \"punchline\": \"A coronal mass ejection.\"}"]